esp8266/Arduino/libraries/ESP8266mDNS/ESP8266mDNS.cpp
    uint8_t tmp8;
    uint16_t answerPort = 0;
    uint8_t answerIp[4] = { 0,0,0,0 };
    char answerHostName[255];
    bool serviceMatch = false;
    MDNSAnswer *answer;
    uint8_t partsCollected = 0;
    uint8_t stringsRead = 0;

    answerHostName[0] = '\0';

    // Clear answer list
    if (_newQuery) {
      int oldAnswers = _getNumAnswers();
      for (int n = oldAnswers - 1; n >= 0; n--) {
        answer = _getAnswerFromIdx(n);
        os_free(answer->hostname);
        os_free(answer);
        answer = 0;
      }
      _answers = 0;
      _newQuery = false;
    }

    while (numAnswers--) {
      // Read name
      stringsRead = 0;
      do {
        tmp8 = _conn_read8();
        if (tmp8 & 0xC0) { // Compressed pointer (not supported)
          tmp8 = _conn_read8();
          break;
        }
        if (tmp8 == 0x00) { // End of name
          break;
        }
        if(stringsRead > 3){
#ifdef DEBUG_ESP_MDNS_RX
          DEBUG_ESP_PORT.println("failed to read the response name");
#endif
          _conn->flush();
          return;
        }
        _conn_readS(serviceName, tmp8);
        serviceName[tmp8] = '\0';
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf(" %d ", tmp8);
        for (int n = 0; n < tmp8; n++) {
          DEBUG_ESP_PORT.printf("%c", serviceName[n]);
        }
        DEBUG_ESP_PORT.println();
#endif
        if (serviceName[0] == '_') {
          if (strcmp(&serviceName[1], _query->_service) == 0) {
            serviceMatch = true;
#ifdef DEBUG_ESP_MDNS_RX
            DEBUG_ESP_PORT.printf("found matching service: %s\n", _query->_service);
#endif
          }
        }
        stringsRead++;
      } while (true);

      uint16_t answerType = _conn_read16(); // Read type
      uint16_t answerClass = _conn_read16(); // Read class
      uint32_t answerTtl = _conn_read32(); // Read ttl
      uint16_t answerRdlength = _conn_read16(); // Read rdlength

      (void) answerClass;
      (void) answerTtl;

      if(answerRdlength > 255){
        if(answerType == MDNS_TYPE_TXT && answerRdlength < 1460){
          while(--answerRdlength) _conn->read();
        } else {
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf("Data len too long! %u\n", answerRdlength);
#endif
          _conn->flush();
          return;
        }
      }

#ifdef DEBUG_ESP_MDNS_RX
      DEBUG_ESP_PORT.printf("type: %04x rdlength: %d\n", answerType, answerRdlength);
#endif

      if (answerType == MDNS_TYPE_PTR) {
        partsCollected |= 0x01;
        _conn_readS(hostName, answerRdlength); // Read rdata
        if(hostName[answerRdlength-2] & 0xc0){
          memcpy(answerHostName, hostName+1, answerRdlength-3);
          answerHostName[answerRdlength-3] = '\0';
        }
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf("PTR %d ", answerRdlength);
        for (int n = 0; n < answerRdlength; n++) {
          DEBUG_ESP_PORT.printf("%c", hostName[n]);
        }
        DEBUG_ESP_PORT.println();
#endif
      }

      else if (answerType == MDNS_TYPE_TXT) {
        partsCollected |= 0x02;
        _conn_readS(hostName, answerRdlength); // Read rdata
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf("TXT %d ", answerRdlength);
        for (int n = 0; n < answerRdlength; n++) {
          DEBUG_ESP_PORT.printf("%c", hostName[n]);
        }
        DEBUG_ESP_PORT.println();
#endif
      }

      else if (answerType == MDNS_TYPE_SRV) {
        partsCollected |= 0x04;
        uint16_t answerPrio = _conn_read16(); // Read priority
        uint16_t answerWeight = _conn_read16(); // Read weight
        answerPort = _conn_read16(); // Read port

        (void) answerPrio;
        (void) answerWeight;

        // Read hostname
        tmp8 = _conn_read8();
        if (tmp8 & 0xC0) { // Compressed pointer (not supported)
#ifdef DEBUG_ESP_MDNS_RX
          DEBUG_ESP_PORT.println("Skipping compressed pointer");
#endif
          tmp8 = _conn_read8();
        }
        else {
          _conn_readS(answerHostName, tmp8);
          answerHostName[tmp8] = '\0';
#ifdef DEBUG_ESP_MDNS_RX
          DEBUG_ESP_PORT.printf("SRV %d ", tmp8);
          for (int n = 0; n < tmp8; n++) {
            DEBUG_ESP_PORT.printf("%02x ", answerHostName[n]);
          }
          DEBUG_ESP_PORT.printf("\n%s\n", answerHostName);
#endif
          if (answerRdlength - (6 + 1 + tmp8) > 0) { // Skip any remaining rdata
            _conn_readS(hostName, answerRdlength - (6 + 1 + tmp8));
          }
        }
      }

      else if (answerType == MDNS_TYPE_A) {
        partsCollected |= 0x08;
        for (int i = 0; i < 4; i++) {
          answerIp[i] = _conn_read8();
        }
      }
      else {
#ifdef DEBUG_ESP_MDNS_RX
          DEBUG_ESP_PORT.printf("Ignoring unsupported type %02x\n", tmp8);
#endif
          for (int n = 0; n < answerRdlength; n++)
		(void)_conn_read8();
      }

      if ((partsCollected == 0x0F) && serviceMatch) {
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.println("All answers parsed, adding to _answers list..");
#endif
        // Add new answer to answer list
        if (_answers == 0) {
          _answers = (struct MDNSAnswer*)(os_malloc(sizeof(struct MDNSAnswer)));
          answer = _answers;
        }
        else {
          answer = _answers;
          while (answer->next != 0) {
            answer = answer->next;
          }
          answer->next = (struct MDNSAnswer*)(os_malloc(sizeof(struct MDNSAnswer)));
          answer = answer->next;
        }
        answer->next = 0;
        answer->hostname = 0;

        // Populate new answer
        answer->port = answerPort;
        for (int i = 0; i < 4; i++) {
          answer->ip[i] = answerIp[i];
        }
        answer->hostname = (char *)os_malloc(strlen(answerHostName) + 1);
        os_strcpy(answer->hostname, answerHostName);
        _conn->flush();
        return;
      }
    }
    
    _conn->flush();
    return;
  }

  // PARSE REQUEST NAME

  hostNameLen = _conn_read8() % 255;
  _conn_readS(hostName, hostNameLen);
  hostName[hostNameLen] = '\0';

  if(hostName[0] == '_'){
    serviceParsed = true;
    memcpy(serviceName, hostName+1, hostNameLen);
    serviceNameLen = hostNameLen-1;
    hostNameLen = 0;
  }

  if(hostNameLen > 0 && !_hostName.equals(hostName) && !_instanceName.equals(hostName)){
#ifdef DEBUG_ESP_MDNS_ERR
    DEBUG_ESP_PORT.printf("ERR_NO_HOST: %s\n", hostName);
    DEBUG_ESP_PORT.printf("hostname: %s\n", _hostName.c_str() );
    DEBUG_ESP_PORT.printf("instance: %s\n", _instanceName.c_str() );
#endif
    _conn->flush();
    return;
  }

