esp8266/Arduino/libraries/ESP8266mDNS/ESP8266mDNS.cpp
  if(!serviceParsed){
    serviceNameLen = _conn_read8() % 255;
    _conn_readS(serviceName, serviceNameLen);
    serviceName[serviceNameLen] = '\0';

    if(serviceName[0] == '_'){
      memmove(serviceName, serviceName+1, serviceNameLen);
      serviceNameLen--;
      serviceParsed = true;
    } else if(serviceNameLen == 5 && strcmp("local", serviceName) == 0){
      tmp = _conn_read8();
      if(tmp == 0){
        serviceParsed = true;
        serviceNameLen = 0;
        protoParsed = true;
        protoNameLen = 0;
        localParsed = true;
      } else {
#ifdef DEBUG_ESP_MDNS_ERR
        DEBUG_ESP_PORT.printf("ERR_FQDN: %s\n", serviceName);
#endif
        _conn->flush();
        return;
      }
    } else {
#ifdef DEBUG_ESP_MDNS_ERR
      DEBUG_ESP_PORT.printf("ERR_SERVICE: %s\n", serviceName);
#endif
      _conn->flush();
      return;
    }
  }

  if(!protoParsed){
    protoNameLen = _conn_read8() % 255;
    _conn_readS(protoName, protoNameLen);
    protoName[protoNameLen] = '\0';
    if(protoNameLen == 4 && protoName[0] == '_'){
      memmove(protoName, protoName+1, protoNameLen);
      protoNameLen--;
      protoParsed = true;
    } else if(strcmp("services", serviceName) == 0 && strcmp("_dns-sd", protoName) == 0){
      _conn->flush();
      IPAddress interface = _getRequestMulticastInterface();
      _replyToTypeEnumRequest(interface);
      return;
    } else {
#ifdef DEBUG_ESP_MDNS_ERR
      DEBUG_ESP_PORT.printf("ERR_PROTO: %s\n", protoName);
#endif
      _conn->flush();
      return;
    }
  }

  if(!localParsed){
    char localName[32];
    uint8_t localNameLen = _conn_read8() % 31;
    _conn_readS(localName, localNameLen);
    localName[localNameLen] = '\0';
    tmp = _conn_read8();
    if(localNameLen == 5 && strcmp("local", localName) == 0 && tmp == 0){
      localParsed = true;
    } else {
#ifdef DEBUG_ESP_MDNS_ERR
      DEBUG_ESP_PORT.printf("ERR_FQDN: %s\n", localName);
#endif
      _conn->flush();
      return;
    }
  }

  if(serviceNameLen > 0 && protoNameLen > 0){
    servicePort = _getServicePort(serviceName, protoName);
    if(servicePort == 0){
#ifdef DEBUG_ESP_MDNS_ERR
      DEBUG_ESP_PORT.printf("ERR_NO_SERVICE: %s\n", serviceName);
#endif
      _conn->flush();
      return;
    }
  } else if(serviceNameLen > 0 || protoNameLen > 0){
#ifdef DEBUG_ESP_MDNS_ERR
    DEBUG_ESP_PORT.printf("ERR_SERVICE_PROTO: %s\n", serviceName);
#endif
    _conn->flush();
    return;
  }

  // RESPOND

#ifdef DEBUG_ESP_MDNS_RX
  DEBUG_ESP_PORT.printf("RX: REQ, ID:%u, Q:%u, A:%u, NS:%u, ADD:%u\n", packetHeader[0], packetHeader[2], packetHeader[3], packetHeader[4], packetHeader[5]);
#endif

  uint16_t currentType;
  uint16_t currentClass;

  int numQuestions = packetHeader[2];
  if(numQuestions > 4) numQuestions = 4;
  uint16_t questions[4];
  int question = 0;

  while(numQuestions--){
    currentType = _conn_read16();
    if(currentType & MDNS_NAME_REF){ //new header handle it better!
      currentType = _conn_read16();
    }
    currentClass = _conn_read16();
    if(currentClass & MDNS_CLASS_IN) questions[question++] = currentType;

    if(numQuestions > 0){
      if(_conn_read16() != 0xC00C){//new question but for another host/service
        _conn->flush();
        numQuestions = 0;
      }
    }

#ifdef DEBUG_ESP_MDNS_RX
    DEBUG_ESP_PORT.printf("REQ: ");
    if(hostNameLen > 0) DEBUG_ESP_PORT.printf("%s.", hostName);
    if(serviceNameLen > 0) DEBUG_ESP_PORT.printf("_%s.", serviceName);
    if(protoNameLen > 0) DEBUG_ESP_PORT.printf("_%s.", protoName);
    DEBUG_ESP_PORT.printf("local. ");

    if(currentType == MDNS_TYPE_AAAA) DEBUG_ESP_PORT.printf("  AAAA ");
    else if(currentType == MDNS_TYPE_A) DEBUG_ESP_PORT.printf("  A ");
    else if(currentType == MDNS_TYPE_PTR) DEBUG_ESP_PORT.printf("  PTR ");
    else if(currentType == MDNS_TYPE_SRV) DEBUG_ESP_PORT.printf("  SRV ");
    else if(currentType == MDNS_TYPE_TXT) DEBUG_ESP_PORT.printf("  TXT ");
    else DEBUG_ESP_PORT.printf("  0x%04X ", currentType);

    if(currentClass == MDNS_CLASS_IN) DEBUG_ESP_PORT.printf("  IN ");
    else if(currentClass == MDNS_CLASS_IN_FLUSH_CACHE) DEBUG_ESP_PORT.printf("  IN[F] ");
    else DEBUG_ESP_PORT.printf("  0x%04X ", currentClass);

    DEBUG_ESP_PORT.printf("\n");
#endif
  }
  uint8_t questionMask = 0;
  uint8_t responseMask = 0;
  for(i=0;i<question;i++){
    if(questions[i] == MDNS_TYPE_A) {
      questionMask |= 0x1;
      responseMask |= 0x1;
    } else if(questions[i] == MDNS_TYPE_SRV) {
      questionMask |= 0x2;
      responseMask |= 0x3;
    } else if(questions[i] == MDNS_TYPE_TXT) {
      questionMask |= 0x4;
      responseMask |= 0x4;
    } else if(questions[i] == MDNS_TYPE_PTR) {
      questionMask |= 0x8;
      responseMask |= 0xF;
    }
  }

  IPAddress interface = _getRequestMulticastInterface();
  return _replyToInstanceRequest(questionMask, responseMask, serviceName, protoName, servicePort, interface);
}

void MDNSResponder::enableArduino(uint16_t port, bool auth){

  addService("arduino", "tcp", port);
  addServiceTxt("arduino", "tcp", "tcp_check", "no");
  addServiceTxt("arduino", "tcp", "ssh_upload", "no");
  addServiceTxt("arduino", "tcp", "board", ARDUINO_BOARD);
  addServiceTxt("arduino", "tcp", "auth_upload", (auth) ? "yes":"no");
}

void MDNSResponder::_replyToTypeEnumRequest(IPAddress multicastInterface) {
  MDNSService* servicePtr;
  for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next) {
    if(servicePtr->_port > 0){
      char *service = servicePtr->_name;
      char *proto = servicePtr->_proto;
      //uint16_t port = servicePtr->_port;

#ifdef DEBUG_ESP_MDNS_TX
      DEBUG_ESP_PORT.printf("TX: service:%s, proto:%s\n", service, proto);
#endif

      char sdHostName[] = "_services";
      size_t sdHostNameLen = 9;
      char sdServiceName[] = "_dns-sd";
      size_t sdServiceNameLen = 7;
      char sdProtoName[] = "_udp";
      size_t sdProtoNameLen = 4;

      char underscore[]  = "_";

      // build service name with _
      char serviceName[os_strlen(service) + 2];
      os_strcpy(serviceName, underscore);
      os_strcat(serviceName, service);
      size_t serviceNameLen = os_strlen(serviceName);

      //build proto name with _
      char protoName[5];
      os_strcpy(protoName, underscore);
      os_strcat(protoName, proto);
      size_t protoNameLen = 4;

