esp8266/Arduino/libraries/ESP8266mDNS/ESP8266mDNS.cpp
      //local string
      char localName[] = "local";
      size_t localNameLen = 5;

      //terminator
      char terminator[] = "\0";

      //Write the header
      _conn->flush();
      uint8_t head[12] = {
        0x00, 0x00, //ID = 0
        0x84, 0x00, //Flags = response + authoritative answer
        0x00, 0x00, //Question count
        0x00, 0x01, //Answer count
        0x00, 0x00, //Name server records
        0x00, 0x00, //Additional records
      };
      _conn->append(reinterpret_cast<const char*>(head), 12);

      // Send the Name field (ie. "_services._dns-sd._udp.local")
      _conn->append(reinterpret_cast<const char*>(&sdHostNameLen), 1);         // length of "_services"
      _conn->append(reinterpret_cast<const char*>(sdHostName), sdHostNameLen); // "_services"
      _conn->append(reinterpret_cast<const char*>(&sdServiceNameLen), 1);      // length of "_dns-sd"
      _conn->append(reinterpret_cast<const char*>(sdServiceName), sdServiceNameLen);// "_dns-sd"
      _conn->append(reinterpret_cast<const char*>(&sdProtoNameLen), 1);        // length of "_udp"
      _conn->append(reinterpret_cast<const char*>(sdProtoName), sdProtoNameLen); // "_udp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

      //Send the type, class, ttl and rdata length
      uint8_t ptrDataLen = serviceNameLen + protoNameLen + localNameLen + 4;   // 4 is three label sizes and the terminator
      uint8_t ptrAttrs[10] = {
        0x00, 0x0c,             //PTR record query
        0x00, 0x01,             //Class IN
        0x00, 0x00, 0x11, 0x94, //TTL 4500
        0x00, ptrDataLen,       //RData length
      };
      _conn->append(reinterpret_cast<const char*>(ptrAttrs), 10);

      //Send the RData (ie. "_http._tcp.local")
      _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);        // length of "_http"
      _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_http"
      _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);          // length of "_tcp"
      _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);   // "_tcp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

      ip_addr_t ifaddr;
      ifaddr.addr = multicastInterface;
      _conn->setMulticastInterface(ifaddr);
      _conn->send();
    }
  }
}

void MDNSResponder::_replyToInstanceRequest(uint8_t questionMask, uint8_t responseMask, char * service, char *proto, uint16_t port, IPAddress multicastInterface) {
  int i;
  if(questionMask == 0) return;
  if(responseMask == 0) return;

#ifdef DEBUG_ESP_MDNS_TX
    DEBUG_ESP_PORT.printf("TX: qmask:%01X, rmask:%01X, service:%s, proto:%s, port:%u\n", questionMask, responseMask, service, proto, port);
#endif


  String instanceName = _instanceName;
  size_t instanceNameLen = instanceName.length();

  String hostName = _hostName;
  size_t hostNameLen = hostName.length();

  char underscore[]  = "_";
 
  // build service name with _
  char serviceName[os_strlen(service)+2];
  os_strcpy(serviceName,underscore);
  os_strcat(serviceName, service);
  size_t serviceNameLen = os_strlen(serviceName);

  //build proto name with _
  char protoName[5];
  os_strcpy(protoName,underscore);
  os_strcat(protoName, proto);
  size_t protoNameLen = 4;

  //local string
  char localName[] = "local";
  size_t localNameLen = 5;

  //terminator
  char terminator[] = "\0";

  uint8_t answerMask = responseMask & questionMask;
  uint8_t answerCount = 0;
  uint8_t additionalMask = responseMask & ~questionMask;
  uint8_t additionalCount = 0;
  for(i=0;i<4;i++){
    if(answerMask & (1 << i)) answerCount++;
    if(additionalMask & (1 << i)) additionalCount++;
  }


 //Write the header
  _conn->flush();
  uint8_t head[12] = {
    0x00, 0x00, //ID = 0
    0x84, 0x00, //Flags = response + authoritative answer
    0x00, 0x00, //Question count
    0x00, answerCount, //Answer count
    0x00, 0x00, //Name server records
    0x00, additionalCount, //Additional records
  };
  _conn->append(reinterpret_cast<const char*>(head), 12);

  for(int responseSection = 0; responseSection < 2; ++responseSection) {

    // PTR Response
    if((responseSection == 0 ? answerMask : additionalMask) & 0x8){
      // Send the Name field (ie. "_http._tcp.local")
      _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);        // length of "_http"
      _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_http"
      _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);          // length of "_tcp"
      _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);   // "_tcp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

      //Send the type, class, ttl and rdata length
      uint8_t ptrDataLen = instanceNameLen + serviceNameLen + protoNameLen + localNameLen + 5; // 5 is four label sizes and the terminator
      uint8_t ptrAttrs[10] = {
        0x00, 0x0c,             //PTR record query
        0x00, 0x01,             //Class IN
        0x00, 0x00, 0x00, 0x78, //TTL 120
        0x00, ptrDataLen,       //RData length
      };
      _conn->append(reinterpret_cast<const char*>(ptrAttrs), 10);

      //Send the RData (ie. "My IOT device._http._tcp.local")
      _conn->append(reinterpret_cast<const char*>(&instanceNameLen), 1);       // length of "My IOT device"
      _conn->append(reinterpret_cast<const char*>(instanceName.c_str()), instanceNameLen);// "My IOT device"
      _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);        // length of "_http"
      _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_http"
      _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);          // length of "_tcp"
      _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);   // "_tcp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator
    }

    //TXT Responce
    if((responseSection == 0 ? answerMask : additionalMask) & 0x4){
      //Send the name field (ie. "My IOT device._http._tcp.local")
      _conn->append(reinterpret_cast<const char*>(&instanceNameLen), 1);       // length of "My IOT device"
      _conn->append(reinterpret_cast<const char*>(instanceName.c_str()), instanceNameLen);// "My IOT device"
      _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);        // length of "_http"
      _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_http"
      _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);          // length of "_tcp"
      _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);   // "_tcp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

      //Send the type, class, ttl and rdata length
      uint8_t txtDataLen = _getServiceTxtLen(service,proto);
      uint8_t txtAttrs[10] = {
        0x00, 0x10,             //TXT record query
        0x80, 0x01,             //Class IN, with cache flush
        0x00, 0x00, 0x11, 0x94, //TTL 4500
        0x00, txtDataLen,       //RData length
      };
      _conn->append(reinterpret_cast<const char*>(txtAttrs), 10);

      //Send the RData
      MDNSTxt * txtPtr = _getServiceTxt(service,proto);
      while(txtPtr !=0){
        uint8_t txtLen = txtPtr->_txt.length();
        _conn->append(reinterpret_cast<const char*>(&txtLen), 1);                  // length of txt
        _conn->append(reinterpret_cast<const char*>(txtPtr->_txt.c_str()), txtLen);// the txt
        txtPtr = txtPtr->_next;
      }
    }


    //SRV Responce
    if((responseSection == 0 ? answerMask : additionalMask) & 0x2){
      //Send the name field (ie. "My IOT device._http._tcp.local")
      _conn->append(reinterpret_cast<const char*>(&instanceNameLen), 1);       // length of "My IOT device"
      _conn->append(reinterpret_cast<const char*>(instanceName.c_str()), instanceNameLen);// "My IOT device"
      _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);        // length of "_http"
      _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_http"
      _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);          // length of "_tcp"
      _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);   // "_tcp"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

      //Send the type, class, ttl, rdata length, priority and weight
      uint8_t srvDataSize = hostNameLen + localNameLen + 3; // 3 is 2 lable size bytes and the terminator
      srvDataSize += 6; // Size of Priority, weight and port
      uint8_t srvAttrs[10] = {
        0x00, 0x21,             //Type SRV
        0x80, 0x01,             //Class IN, with cache flush
        0x00, 0x00, 0x00, 0x78, //TTL 120
        0x00, srvDataSize,      //RData length
      };
      _conn->append(reinterpret_cast<const char*>(srvAttrs), 10);

      //Send the RData Priority weight and port
      uint8_t srvRData[6] = {
        0x00, 0x00,             //Priority 0
        0x00, 0x00,             //Weight 0
        (uint8_t)((port >> 8) & 0xFF), (uint8_t)(port & 0xFF)
      };
      _conn->append(reinterpret_cast<const char*>(srvRData), 6);
      //Send the RData (ie. "esp8266.local")
      _conn->append(reinterpret_cast<const char*>(&hostNameLen), 1);           // length of "esp8266"
      _conn->append(reinterpret_cast<const char*>(hostName.c_str()), hostNameLen);// "esp8266"
      _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
      _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
      _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

